Repository: borzov/vpn-bar
Catalog: Sources/VPNBarApp/Resources/*.lproj/Localizable.strings
Languages: ru

# common.button.ok
source: OK
ru: ОК

# common.unit.seconds
source: seconds
ru: секунд

# menu.empty.noConnections
source: No VPN Connections
ru: Нет VPN подключений

# menu.action.openNetworkPreferences
source: Open Network Preferences...
ru: Открыть настройки сети...

# menu.action.settings
source: Settings
ru: Настройки

# menu.action.quit
source: Quit
ru: Выйти

# menu.action.disconnectAll
source: Disconnect All
ru: Отключить все

# menu.status.connected
source: Connected
ru: подключено

# menu.status.connecting
source: Connecting...
ru: подключение...

# menu.status.disconnecting
source: Disconnecting...
ru: отключение...

# menu.status.disconnected
source: Disconnected
ru: отключено

# menu.accessibility.toggleConnection
source: Click to toggle connection
ru: Нажмите для переключения подключения

# status.tooltip.connecting
source: VPN Connecting…
ru: VPN подключается…

# status.tooltip.connected
source: VPN Connected
ru: VPN подключен

# status.tooltip.disconnected
source: VPN Disconnected
ru: VPN отключен

# status.tooltip.connectedTo
source: Connected to %@
ru: Подключено к %@

# status.accessibility.label
source: VPN Status
ru: Статус VPN

# status.accessibility.help
source: Click to toggle VPN, right-click for menu
ru: Нажмите для переключения VPN, правый клик для меню

# notifications.title.connected
source: VPN Connected
ru: VPN подключен

# notifications.title.disconnected
source: VPN Disconnected
ru: VPN отключен

# notifications.body.connected
source: VPN Connected
ru: VPN подключен

# notifications.body.disconnected
source: VPN Disconnected
ru: VPN отключен

# notifications.body.connectedTo
source: Connected to %@
ru: Подключено к %@

# notifications.body.disconnectedFrom
source: Disconnected from %@
ru: Отключено от %@

# settings.title.preferences
source: Preferences
ru: Настройки

# settings.tab.general
source: General
ru: Основные

# settings.tab.hotkeys
source: Hotkeys
ru: Горячие клавиши

# settings.tab.about
source: About
ru: О программе

# settings.status.title
source: Status Update
ru: Обновление статуса

# settings.status.description
source: How often to refresh VPN statuses.
ru: Как часто обновлять статус VPN.

# settings.status.seconds
source: seconds
ru: секунд

# settings.notifications.title
source: Notifications
ru: Уведомления

# settings.notifications.toggle
source: Show notifications when VPN connects or disconnects
ru: Показывать уведомления при подключении или отключении VPN

# settings.notifications.description
source: Display system notifications on connect/disconnect.
ru: Показывать системные уведомления при подключении/отключении.

# settings.display.title
source: Display
ru: Отображение

# settings.display.showName
source: Show connection name in tooltip
ru: Показывать имя подключения во всплывающей подсказке

# settings.display.description
source: Show the VPN name in the status tooltip.
ru: Показывать имя VPN во всплывающей подсказке.

# settings.startup.title
source: Startup
ru: Запуск

# settings.startup.launchAtLogin
source: Launch at login
ru: Запускать при входе в систему

# settings.startup.description
source: Start VPN Bar at login.
ru: Запускать VPN Bar при входе в систему.

# settings.startup.requires13
source: (Requires macOS 13 or later)
ru: (Требуется macOS 13 или новее)

# settings.hotkey.title
source: Hotkey
ru: Горячая клавиша

# settings.hotkey.record
source: Record Shortcut
ru: Записать комбинацию

# settings.hotkey.pressKeys
source: Press keys...
ru: Нажмите клавиши...

# settings.hotkey.description
source: Global shortcut to toggle VPN.
ru: Глобальная комбинация для переключения VPN.

# settings.hotkey.validation.missingModifier
source: Hotkey must include at least one modifier key (⌘, ⌃, or ⌥).
ru: Комбинация должна содержать хотя бы одну клавишу-модификатор (⌘, ⌃ или ⌥).

# settings.hotkey.validation.reserved
source: This key combination is reserved by the system. Please choose another.
ru: Эта комбинация клавиш зарезервирована системой. Выберите другую.

# settings.hotkey.keyPlaceholder
source: Key %d
ru: Клавиша %d

# settings.about.version
source: Version %@
ru: Версия %@

# settings.about.author
source: Author: Maksim Borzov
ru: Автор: Максим Борзов

# settings.about.description
source: A menu bar utility to quickly view, connect, and manage your macOS VPN configurations. Keeps status at a glance and toggles with a global hotkey.
ru: Утилита, работающая в менюбаре: помогает быстро смотреть статус, подключать и управлять VPN-конфигурациями macOS, есть глобальная горячая клавиша для переключения.

# settings.about.repoButton
source: Open repository
ru: Открыть репозиторий

# error.vpn.noConfigurations
source: No VPN configurations found. Configure VPN in System Preferences → Network.
ru: VPN-подключения не найдены. Настройте VPN в Системных настройках → Сеть.

# error.vpn.loadFrameworkFailed
source: Failed to load NetworkExtension framework: %@
ru: Не удалось загрузить NetworkExtension framework: %@

# error.vpn.sharedManagerUnavailable
source: Error: sharedManager unavailable
ru: Ошибка: sharedManager недоступен

# error.vpn.connectionNotFound
source: VPN connection not found: %@
ru: VPN подключение не найдено: %@

# error.vpn.sessionNotFoundCreating
source: VPN session not found for %@, creating...
ru: Сессия VPN не найдена для %@, создаем...

# error.vpn.sessionNotFound
source: VPN session not found for %@
ru: Сессия VPN не найдена для %@

# error.vpn.sessionCreateFailed
source: Error creating session for %@
ru: Ошибка создания сессии для %@
